*** [2022-10-24 Mon]
:LOGBOOK:
CLOCK: [2022-10-24 Mon 20:20]--[2022-10-24 Mon 20:46] =>  0:26
temas diversos en work
CLOCK: [2022-10-24 Mon 19:15]--[2022-10-24 Mon 20:18] =>  1:03
estudio tailwinds
CLOCK: [2022-10-24 Mon 18:20]--[2022-10-24 Mon 19:15] =>  0:55
tunning emacs modeline y goto-brace C-5
CLOCK: [2022-10-24 Mon 17:50]--[2022-10-24 Mon 18:16] =>  0:26
tuneo minimo emacs
CLOCK: [2022-10-24 Mon 15:00]--[2022-10-24 Mon 15:28] =>  0:28
tuneando emacs init.el
CLOCK: [2022-10-24 Mon 13:50]--[2022-10-24 Mon 15:00] =>  1:10
debuggiando el 1.log - refactorice fechador.html
CLOCK: [2022-10-24 Mon 11:35]--[2022-10-24 Mon 13:10] =>  1:35
alpinejs cobr terminado - retiros terminado
CLOCK: [2022-10-24 Mon 11:00]--[2022-10-24 Mon 11:35] =>  0:35
tunning emacs smartparents y otros atajos necesarios
CLOCK: [2022-10-24 Mon 09:10]--[2022-10-24 Mon 10:58] =>  1:48
alpinejs:cobr - tuneando:retiros
CLOCK: [2022-10-24 Mon 08:51]--[2022-10-24 Mon 09:10] =>  0:19
tuneo emacs. Instalo N A N O themes y modeline.
:END:
*** [2022-10-23 Sun]
:LOGBOOK:
CLOCK: [2022-10-23 Sun 21:10]--[2022-10-23 Sun 21:45] =>  0:35
tuneando emacs
CLOCK: [2022-10-23 Sun 20:05]--[2022-10-23 Sun 21:08] =>  1:03
arreglos bugs de emergencia en el sistema
CLOCK: [2022-10-23 Sun 12:20]--[2022-10-23 Sun 12:56] =>  0:36
limpie stock.py
CLOCK: [2022-10-23 Sun 11:41]--[2022-10-23 Sun 12:20] =>  0:39
instalacion de algunos interesantes paquetes extra
CLOCK: [2022-10-23 Sun 09:27]--[2022-10-23 Sun 10:20] =>  0:53
tuneando emacs varios temas menores- hice branch tree1 para hacer
diferencia con lo instalado en sistema.
:END:
*** [2022-10-22 Sat]
:LOGBOOK:
CLOCK: [2022-10-22 Sat 18:24]--[2022-10-22 Sat 21:30] =>  3:06
terminando lsp con los otros modes y otras cosas.
CLOCK: [2022-10-22 Sat 13:08]--[2022-10-22 Sat 15:35] =>  2:27
probando eglot- luego termine instalando lsp
CLOCK: [2022-10-22 Sat 11:25]--[2022-10-22 Sat 12:28] =>  1:03
probando el sistema para subir branch y merge.
termine de probar y subi los cambios si todo anda bien hago merge el
lunes y abro otra rama.
:END:
*** [2022-10-21 Fri]
:LOGBOOK:
CLOCK: [2022-10-21 Fri 21:50]--[2022-10-21 Fri 23:12] =>  1:22
tuneando emacs python autocomplete y demas- negativo
CLOCK: [2022-10-21 Fri 21:00]--[2022-10-21 Fri 21:44] =>  0:44
limpiando python stock.py falta la mitad
CLOCK: [2022-10-21 Fri 17:05]--[2022-10-21 Fri 18:10] =>  1:05
tuneando meow cambiando seting.
CLOCK: [2022-10-21 Fri 14:10]--[2022-10-21 Fri 14:38] =>  0:28
corregi un bug de hace mucho en js que el parent del event.target no
existe elimino los console.logs inactivos.
CLOCK: [2022-10-21 Fri 13:05]--[2022-10-21 Fri 13:30] =>  0:25
borro print de py que littering el log1
CLOCK: [2022-10-21 Fri 12:40]--[2022-10-21 Fri 13:05] =>  0:25
cambios a meow para hacerlo mas rapido y eficiente.
CLOCK: [2022-10-21 Fri 11:10]--[2022-10-21 Fri 12:35] =>  1:25
arreglo pandas errores preventivos
CLOCK: [2022-10-21 Fri 10:35]--[2022-10-21 Fri 10:52] =>  0:17
anule agitate por performance
CLOCK: [2022-10-21 Fri 08:52]--[2022-10-21 Fri 10:33] =>  1:41
alpinejs totales.html pero con grafico y correccion por inflacion
CLOCK: [2022-10-21 Fri 08:17]--[2022-10-21 Fri 08:50] =>  0:33
mande seven e investigue un poco de python-env sin resultado
:END:
*** [2022-10-20 Thu]
:LOGBOOK:
CLOCK: [2022-10-20 Thu 19:24]--[2022-10-20 Thu 20:55] =>  1:31
emacs intentando con pipenv
CLOCK: [2022-10-20 Thu 18:00]--[2022-10-20 Thu 18:45] =>  0:45
cree el git para nuevo emacs y otras cosas
CLOCK: [2022-10-20 Thu 16:53]--[2022-10-20 Thu 17:40] =>  0:47
tuneos varios emacs
CLOCK: [2022-10-20 Thu 16:05]--[2022-10-20 Thu 16:52] =>  0:47
validacion de campos incluidos en autoComplete
CLOCK: [2022-10-20 Thu 14:57]--[2022-10-20 Thu 16:02] =>  1:05
validacion por css :required y pattern
CLOCK: [2022-10-20 Thu 14:00]--[2022-10-20 Thu 14:45] =>  0:45
termino de tunear con meowa
CLOCK: [2022-10-20 Thu 09:42]--[2022-10-20 Thu 13:05] =>  3:23
gran transformacion de emacs a meow y empece todo de nuevo
:END:
*** [2022-10-19 Wed]
:LOGBOOK:
CLOCK: [2022-10-19 Wed 21:40]--[2022-10-19 Wed 22:25] =>  0:45
intento en autoComplete tema enter y tunning emacs
CLOCK: [2022-10-19 Wed 17:33]--[2022-10-19 Wed 20:26] =>  2:53
alpinejs ventas.html
CLOCK: [2022-10-19 Wed 15:00]--[2022-10-19 Wed 15:35] =>  0:35
tuneando emacs fonts cambio a iosevka comfy
CLOCK: [2022-10-19 Wed 14:35]--[2022-10-19 Wed 14:59] =>  0:24
tuneando emacs
CLOCK: [2022-10-19 Wed 13:46]--[2022-10-19 Wed 14:32] =>  0:46
alpinejs planillas con refactorizacion a tree
CLOCK: [2022-10-19 Wed 12:25]--[2022-10-19 Wed 12:56] =>  0:31
tuneando emacs ya estoy entre 3 y 4 segundos
CLOCK: [2022-10-19 Wed 11:13]--[2022-10-19 Wed 12:23] =>  1:10
refactorizacion de articulos y alpinejs verzonas
CLOCK: [2022-10-19 Wed 10:45]--[2022-10-19 Wed 11:07] =>  0:22
intento de modificar autoComplete
CLOCK: [2022-10-19 Wed 09:40]--[2022-10-19 Wed 10:45] =>  1:05
refactorizado de articulos al nuevo diseno. Prueba de autoComplete en
los refactorizados ayer.
:END:
*** [2022-10-18 Tue]
:LOGBOOK:
CLOCK: [2022-10-18 Tue 20:00]--[2022-10-18 Tue 21:07] =>  1:07
tuneando emacs positivo
CLOCK: [2022-10-18 Tue 18:35]--[2022-10-18 Tue 20:00] =>  1:25
encuentro la solucion al autoComplete
CLOCK: [2022-10-18 Tue 17:43]--[2022-10-18 Tue 18:35] =>  0:52
tuneando emacs bastante positivo
CLOCK: [2022-10-18 Tue 14:40]--[2022-10-18 Tue 16:19] =>  1:39
renegando con autocompletado:fracaso
CLOCK: [2022-10-18 Tue 13:40]--[2022-10-18 Tue 14:38] =>  0:58
alpinejs:clientes/listado
CLOCK: [2022-10-18 Tue 13:06]--[2022-10-18 Tue 13:25] =>  0:19
alpinejs: termino cancelados
CLOCK: [2022-10-18 Tue 11:36]--[2022-10-18 Tue 12:23] =>  0:47
alpinejs:cancelados
CLOCK: [2022-10-18 Tue 10:29]--[2022-10-18 Tue 11:15] =>  0:46
alpinejs: zonas y calles
CLOCK: [2022-10-18 Tue 09:39]--[2022-10-18 Tue 10:15] =>  0:36
tuneando emacs prueba de straight positivo.
:END:
*** [2022-10-17 Mon]
:LOGBOOK:
CLOCK: [2022-10-17 Mon 18:59]--[2022-10-17 Mon 20:17] =>  1:18
alpinejs:barrios
CLOCK: [2022-10-17 Mon 17:43]--[2022-10-17 Mon 18:42] =>  0:59
alpinejs:verstock
CLOCK: [2022-10-17 Mon 13:55]--[2022-10-17 Mon 15:26] =>  1:31
bindeando hippie-expand a C-j. alpinejs: salidas
CLOCK: [2022-10-17 Mon 09:56]--[2022-10-17 Mon 12:40] =>  2:44
alpinejs: planos/pdfsistema/impresos/compras/mayor
CLOCK: [2022-10-17 Mon 09:13]--[2022-10-17 Mon 09:41] =>  0:28
probando hippie-expand pero no es muy diferente a dabbrev
refactorizo def cuotaje de formularios.py
:END:
*** [2022-10-16 Sun]
:LOGBOOK:
CLOCK: [2022-10-16 Sun 21:22]--[2022-10-16 Sun 22:25] =>  1:03
instalo w3m-emacs y recorro un poco emacs
:END:
*** [2022-10-15 Sat]
:LOGBOOK:
CLOCK: [2022-10-15 Sat 14:59]--[2022-10-15 Sat 16:30] =>  1:31
terminacion del grafico de doughnut.
CLOCK: [2022-10-15 Sat 09:17]--[2022-10-15 Sat 09:25] =>  0:08
interrumpo pq me voy al hiper y me pongo a cambiar la rueda de la kangoo
:END:
*** [2022-10-14 Fri]
:LOGBOOK:
CLOCK: [2022-10-14 Fri 19:55]--[2022-10-14 Fri 20:33] =>  0:38
renegando con python virtualenv- quite lsp por ahora
CLOCK: [2022-10-14 Fri 19:06]--[2022-10-14 Fri 19:52] =>  0:46
actualizando claves en pass
CLOCK: [2022-10-14 Fri 17:36]--[2022-10-14 Fri 17:41] =>  0:05
interrumpido pq me fui al Fede
CLOCK: [2022-10-14 Fri 13:35]--[2022-10-14 Fri 14:29] =>  0:54
me faltan los graficos
CLOCK: [2022-10-14 Fri 11:26]--[2022-10-14 Fri 12:55] =>  1:29
cuadro de resultado mensual- no es tan facil como parece
CLOCK: [2022-10-14 Fri 10:50]--[2022-10-14 Fri 11:18] =>  0:28
pass agregado de cuentas: hoy aguascordobesas y pago con debito y
adhesion a factura electronica
CLOCK: [2022-10-14 Fri 10:23]--[2022-10-14 Fri 10:46] =>  0:23
excurso a pass habilite browserpass
CLOCK: [2022-10-14 Fri 09:35]--[2022-10-14 Fri 10:07] =>  0:32
arreglado el bug
CLOCK: [2022-10-14 Fri 08:44]--[2022-10-14 Fri 09:34] =>  0:50
bug de emergencia al comprobar de rutina: no andaba la impresion
entre en panico y era que habia agregado una columna a la izq en
fichaje lo clasico que desconfigura la lectura del dni, etc. Hay que
buscar una forma de que eso no sea asi.
:END:
*** [2022-10-13 Thu]
:LOGBOOK:
CLOCK: [2022-10-13 Thu 17:30]--[2022-10-13 Thu 18:30] =>  1:00
prueba con gopass: negativa
CLOCK: [2022-10-13 Thu 16:43]--[2022-10-13 Thu 17:25] =>  0:42
terminado estadisticas
CLOCK: [2022-10-13 Thu 15:14]--[2022-10-13 Thu 15:55] =>  0:41
empiezo a buscar algun tipo de grafico
CLOCK: [2022-10-13 Thu 14:48]--[2022-10-13 Thu 15:14] =>  0:26
terminado con muy poco codigo todo dentro de alpinejs
CLOCK: [2022-10-13 Thu 13:41]--[2022-10-13 Thu 14:07] =>  0:26
usando concepto inflacion para terminar
CLOCK: [2022-10-13 Thu 12:24]--[2022-10-13 Thu 13:09] =>  0:45
reacomodo con insertBefore
CLOCK: [2022-10-13 Thu 10:42]--[2022-10-13 Thu 12:06] =>  1:24
primero: paso estadisticas.html a alpinejs (esta en Vue)
lo logro en alpine pero no logro que se acomoden debajo del parent
CLOCK: [2022-10-13 Thu 09:45]--[2022-10-13 Thu 10:22] =>  0:37
terminado el route desde fichaje a buscador
CLOCK: [2022-10-13 Thu 09:22]--[2022-10-13 Thu 09:45] =>  0:23
pruebo con gnome xorg y xmodmap por un tiempo a mano y luego voy a
desactivar el input-remapper
:END:
*** [2022-10-12 Wed]
:LOGBOOK:
CLOCK: [2022-10-12 Wed 19:46]--[2022-10-12 Wed 20:35] =>  0:49
vinculacion desde fichaje
CLOCK: [2022-10-12 Wed 18:40]--[2022-10-12 Wed 19:14] =>  0:34
establecimos agendas vamos a incorporar la agenda en emacs
CLOCK: [2022-10-12 Wed 14:32]--[2022-10-12 Wed 15:20] =>  0:48
revisar los ultimos trigger agregados- listo
CLOCK: [2022-10-12 Wed 12:59]--[2022-10-12 Wed 13:27] =>  0:28
bug sumar pandas
CLOCK: [2022-10-12 Wed 10:27]--[2022-10-12 Wed 12:43] =>  2:16
varias cosas bug fecha logwhatsapp y resaltado de los whatsappeados hoy
CLOCK: [2022-10-12 Wed 08:07]--[2022-10-12 Wed 08:33] =>  0:26
evaluacion de la extension de la idea de analisis de la efectividad a
los whatsapp. postergada por el momento.
:END:
*** [2022-10-11 Tue]
:LOGBOOK:
CLOCK: [2022-10-11 Tue 17:30]--[2022-10-11 Tue 17:49] =>  0:19
pasado de movimientos y correccion de bug
CLOCK: [2022-10-11 Tue 16:55]--[2022-10-11 Tue 17:29] =>  0:34
subida de la base de datos
CLOCK: [2022-10-11 Tue 16:33]--[2022-10-11 Tue 16:52] =>  0:19
CLOCK: [2022-10-11 Tue 14:08]--[2022-10-11 Tue 16:13] =>  2:05
lista de planillas emitidas y posibilidad de borrarlas
CLOCK: [2022-10-11 Tue 10:50]--[2022-10-11 Tue 13:41] =>  2:51
sistema de registro de visitados
CLOCK: [2022-10-11 Tue 09:42]--[2022-10-11 Tue 10:32] =>  0:50
vista diferenciada de santander y caja
CLOCK: [2022-10-11 Tue 08:13]--[2022-10-11 Tue 09:21] =>  1:08
asiento editable en comentarios
CLOCK: [2022-10-11 Tue 07:56]--[2022-10-11 Tue 08:13] =>  0:17
orden del dia
:END:
*** [2022-10-10 Mon]
:LOGBOOK:
CLOCK: [2022-10-10 Mon 19:30]--[2022-10-10 Mon 19:49] =>  0:19
atajo a agitate-diff-buffer-or-file a F9 muy util y rescate de space-o
para occur dentro del buffer aun en palabras con guion
CLOCK: [2022-10-10 Mon 18:15]--[2022-10-10 Mon 19:10] =>  0:55
poniendo a punto undo-tree
CLOCK: [2022-10-10 Mon 17:05]--[2022-10-10 Mon 18:10] =>  1:05
limpiarTable en fichaje y dispersiones varias
CLOCK: [2022-10-10 Mon 16:16]--[2022-10-10 Mon 16:55] =>  0:39
anotacion de los conceptos pensados cuando estuve en cama
CLOCK: [2022-10-10 Mon 15:00]--[2022-10-10 Mon 15:55] =>  0:55
trabajo en parte con pass que es muy tedioso
CLOCK: [2022-10-10 Mon 13:40]--[2022-10-10 Mon 15:00] =>  1:20
trabajo con hledger- control de caja y puesta a punto
CLOCK: [2022-10-10 Mon 12:04]--[2022-10-10 Mon 12:40] =>  0:36
hago nueva gpg - empiezo a ver forma de importar password de firefox a pass
CLOCK: [2022-10-10 Mon 11:14]--[2022-10-10 Mon 11:50] =>  0:36
probando flycheck: satisfactorio para py/js/html/css
CLOCK: [2022-10-10 Mon 10:31]--[2022-10-10 Mon 11:10] =>  0:39
termino configuracion de lsp-mode probando prescient.(lo saque)
CLOCK: [2022-10-10 Mon 09:28]--[2022-10-10 Mon 10:20] =>  0:52
configuracion de lsp-mode
CLOCK: [2022-10-10 Mon 08:41]--[2022-10-10 Mon 09:14] =>  0:33
varios temas- mirrorin git en GitLab
:END:
*** [2022-10-09 Sun]
:LOGBOOK:
CLOCK: [2022-10-09 Sun 16:05]--[2022-10-09 Sun 16:47] =>  0:42
funciona crypt - recupere la clave hay que usar las herramientas de
busqueda dentro de org.
CLOCK: [2022-10-09 Sun 15:35]--[2022-10-09 Sun 16:05] =>  0:30
hago changelog y pruebo crypt sin resultados
CLOCK: [2022-10-09 Sun 14:40]--[2022-10-09 Sun 15:35] =>  0:55
interesante incorporacion de un addon de pass para firefox. Con tiempo
seguire importando las pass desde firefox para tenerlas en pass
CLOCK: [2022-10-09 Sun 14:15]--[2022-10-09 Sun 14:37] =>  0:22
clave exportada y llevada a orgblok - perdida de tiempo intentando
recuperar una vieja clave(frase olvidada)
CLOCK: [2022-10-09 Sun 13:55]--[2022-10-09 Sun 14:14] =>  0:19
intentando solucionar problemas de term - puedo usar pass en vterm o
sea no necesito term
CLOCK: [2022-10-09 Sun 11:35]--[2022-10-09 Sun 13:00] =>  1:25
instale pass a nivel linux genere gpg y lo usa directo emacs
CLOCK: [2022-10-09 Sun 10:25]--[2022-10-09 Sun 11:30] =>  1:05
instale vterm-term-multi-vterm
CLOCK: [2022-10-09 Sun 10:05]--[2022-10-09 Sun 10:21] =>  0:16
instale dashboard
CLOCK: [2022-10-09 Sun 09:25]--[2022-10-09 Sun 10:04] =>  0:39
instale pythonenv
CLOCK: [2022-10-09 Sun 08:55]--[2022-10-09 Sun 09:25] =>  0:30
comprobacion del bug-axios - existe realmente y solo fue en mobile
CLOCK: [2022-10-09 Sun 08:12]--[2022-10-09 Sun 08:35] =>  0:23
mas ajustes a hledger en lo posible
:END:
*** [2022-10-08 Sat]
:LOGBOOK:
CLOCK: [2022-10-08 Sat 22:13]--[2022-10-08 Sat 23:20] =>  1:07
trabaje con hledger es mucho mas productivo voy a ir arreglando el
journal de a poco.
CLOCK: [2022-10-08 Sat 17:55]--[2022-10-08 Sat 19:24] =>  1:29
instale hledger funcional por ahora por los reportes, luego lo hare
funcionar para pasar los asientos
CLOCK: [2022-10-08 Sat 17:15]--[2022-10-08 Sat 17:52] =>  0:37
cambio de font es operativo, esta para seguir probando
CLOCK: [2022-10-08 Sat 13:55]--[2022-10-08 Sat 14:18] =>  0:23
infructuoso intento de acceso a la ficha individual desde fichaje
CLOCK: [2022-10-08 Sat 13:00]--[2022-10-08 Sat 13:52] =>  0:52
pineado de cdns
CLOCK: [2022-10-08 Sat 12:00]--[2022-10-08 Sat 12:35] =>  0:35
emacs varios
CLOCK: [2022-10-08 Sat 08:10]--[2022-10-08 Sat 08:36] =>  0:26
termine la funcion limpiar tabla
CLOCK: [2022-10-08 Sat 07:35]--[2022-10-08 Sat 08:09] =>  0:34
renegue un poco con el intento de romper el sistema que anda bien
:END:
*** [2022-10-07 Fri]
:LOGBOOK:
CLOCK: [2022-10-07 Fri 17:51]--[2022-10-07 Fri 18:51] =>  1:00
marco una hora de diferentes momentos que prendi la maquina hasta que
arregle el bug critico axios
CLOCK: [2022-10-07 Fri 12:20]--[2022-10-07 Fri 12:48] =>  0:28
corrijo bug en parte de los subtotales falta el iconito
CLOCK: [2022-10-07 Fri 11:16]--[2022-10-07 Fri 12:20] =>  1:04
arregle el tema font y le agregue treemacs
:END:
*** [2022-10-06 Thu]
:LOGBOOK:
CLOCK: [2022-10-06 Thu 19:15]--[2022-10-06 Thu 19:40] =>  0:25
mas configuracion de emacs
CLOCK: [2022-10-06 Thu 18:45]--[2022-10-06 Thu 19:12] =>  0:27
emacs cape y affe le voy encontrando la vuelta a la busqueda
CLOCK: [2022-10-06 Thu 11:50]--[2022-10-06 Thu 12:47] =>  0:57
varios entre trabajos de fedesal y emacs
CLOCK: [2022-10-06 Thu 10:48]--[2022-10-06 Thu 11:48] =>  1:00
puse a punto orderless y corregi bug de actualizacion sin tener en
cuenta condonados/devueltas y pp.
:END:
*** [2022-10-05 Wed]
:LOGBOOK:
CLOCK: [2022-10-05 Wed 16:38]--[2022-10-05 Wed 17:20] =>  0:42
emacs vertico-consult
CLOCK: [2022-10-05 Wed 15:35]--[2022-10-05 Wed 16:10] =>  0:35
temas varios
CLOCK: [2022-10-05 Wed 14:34]--[2022-10-05 Wed 15:34] =>  1:00
emacs counsil
CLOCK: [2022-10-05 Wed 14:16]--[2022-10-05 Wed 14:22] =>  0:06
CLOCK: [2022-10-05 Wed 10:43]--[2022-10-05 Wed 12:30] =>  1:47
hice el proceso para mostrar las cuotas por inflacion
CLOCK: [2022-10-05 Wed 10:16]--[2022-10-05 Wed 10:40] =>  0:24
emacs- vertico again
CLOCK: [2022-10-05 Wed 08:57]--[2022-10-05 Wed 10:01] =>  1:04
hice la tabla de inflacion
CLOCK: [2022-10-05 Wed 07:20]--[2022-10-05 Wed 08:45] =>  1:25
emacs- vertico y corfu
:END:
*** [2022-10-04 Tue]
:LOGBOOK:
CLOCK: [2022-10-04 Tue 22:20]--[2022-10-04 Tue 23:10] =>  0:50
CLOCK: [2022-10-04 Tue 21:12]--[2022-10-04 Tue 22:20] =>  1:08
CLOCK: [2022-10-04 Tue 18:00]--[2022-10-04 Tue 20:18] =>  2:18
emacs configuration
CLOCK: [2022-10-04 Tue 15:50]--[2022-10-04 Tue 16:30] =>  0:40
revision de modulos en emacs descartando lo que no uso
CLOCK: [2022-10-04 Tue 15:30]--[2022-10-04 Tue 15:50] =>  0:20
CLOCK: [2022-10-04 Tue 13:05]--[2022-10-04 Tue 14:23] =>  1:18
terminado la diferenciacion de las pagadas, reniego con un supuesto
tooltip que no estaba en las especificaciones.
CLOCK: [2022-10-04 Tue 11:15]--[2022-10-04 Tue 12:01] =>  0:46
se agrego el iconito en forma muy profesional!!
CLOCK: [2022-10-04 Tue 10:21]--[2022-10-04 Tue 11:03] =>  0:42
agregando class pesos a mano- tedioso-
CLOCK: [2022-10-04 Tue 08:36]--[2022-10-04 Tue 10:10] =>  1:34
hice la unificacion de los sorts en un solo toggle con click
entro en la tediosa parte de cargar en todas las tablas las clases
CLOCK: [2022-10-04 Tue 08:01]--[2022-10-04 Tue 08:36] =>  0:35
comienzo con totalizar-ultima parte
por el momento esta listo. faltaria ver el bug cuando se presente
CLOCK: [2022-10-04 Tue 07:50]--[2022-10-04 Tue 08:01] =>  0:11
CLOCK: [2022-10-04 Tue 07:30]--[2022-10-04 Tue 07:50] =>  0:20
revision infructuosa de emacs para poner jedi en python
:END:
*** [2022-10-03 Mon]
:LOGBOOK:
CLOCK: [2022-10-03 Mon 20:35]--[2022-10-03 Mon 20:57] =>  0:22
CLOCK: [2022-10-03 Mon 18:44]--[2022-10-03 Mon 20:14] =>  1:30
trabajando arduo en el totalizado
CLOCK: [2022-10-03 Mon 14:44]--[2022-10-03 Mon 16:16] =>  1:32
terminado el contador de billetes.
CLOCK: [2022-10-03 Mon 12:49]--[2022-10-03 Mon 14:35] =>  1:46
CLOCK: [2022-10-03 Mon 12:03]--[2022-10-03 Mon 12:28] =>  0:25
CLOCK: [2022-10-03 Mon 11:32]--[2022-10-03 Mon 11:58] =>  0:26
con este addtag atrasos termino la info de cancelados con funcion a
analizar una venta.
CLOCK: [2022-10-03 Mon 09:15]--[2022-10-03 Mon 11:27] =>  2:12
agregue campos en ventas y clientes para calcular el atraso del pago
final de una cuenta con sus correspondientes triggers y los subi al servidor.
:END:
*** [2022-10-02 Sun]
:LOGBOOK:
CLOCK: [2022-10-02 Sun 22:35]--[2022-10-02 Sun 23:07] =>  0:32
CLOCK: [2022-10-02 Sun 19:50]--[2022-10-02 Sun 22:33] =>  2:43
CLOCK: [2022-10-02 Sun 19:32]--[2022-10-02 Sun 19:49] =>  0:17
CLOCK: [2022-10-02 Sun 14:25]--[2022-10-02 Sun 16:57] =>  2:32
mas tuneado
CLOCK: [2022-10-02 Sun 13:40]--[2022-10-02 Sun 14:25] =>  0:45
intento instalar web-mode
CLOCK: [2022-10-02 Sun 12:10]--[2022-10-02 Sun 12:26] =>  0:16
CLOCK: [2022-10-02 Sun 11:35]--[2022-10-02 Sun 12:10] =>  0:35
CLOCK: [2022-10-02 Sun 09:20]--[2022-10-02 Sun 11:35] =>  2:15
instale todo de nuevo con la base de un sistema separado
CLOCK: [2022-10-02 Sun 09:14]--[2022-10-02 Sun 09:18] =>  0:04
empiezo el tuneado de emacs
:END:
*** [2022-10-01 Sat]
:LOGBOOK:
CLOCK: [2022-10-01 Sat 18:15]--[2022-10-01 Sat 19:04] =>  0:49
un placer volver a mi configuracion. Me faltan cosas por resolver pero
estoy mejor asi.
CLOCK: [2022-10-01 Sat 17:20]--[2022-10-01 Sat 18:14] =>  0:54
despues de renegar como enano con doom volvi a mi configuracion
CLOCK: [2022-10-01 Sat 16:55]--[2022-10-01 Sat 17:17] =>  0:22
CLOCK: [2022-10-01 Sat 13:40]--[2022-10-01 Sat 16:52] =>  3:12
renegando con web-mode todavia.
CLOCK: [2022-10-01 Sat 12:43]--[2022-10-01 Sat 13:00] =>  0:17
CLOCK: [2022-10-01 Sat 08:10]--[2022-10-01 Sat 11:29] =>  3:19
:END:
*** [2022-09-30 Fri]
:LOGBOOK:
CLOCK: [2022-09-30 Fri 16:45]--[2022-09-30 Fri 17:35] =>  0:50
listado de ultima cuota no atrasados
CLOCK: [2022-09-30 Fri 14:05]--[2022-09-30 Fri 16:45] =>  2:40
tremenda perdida/inversion de tiempo por unos ajustes no muy
satisfactorios en emacs.
CLOCK: [2022-09-30 Fri 13:40]--[2022-09-30 Fri 13:47] =>  0:07
CLOCK: [2022-09-30 Fri 12:47]--[2022-09-30 Fri 13:00] =>  0:13
CLOCK: [2022-09-30 Fri 12:05]--[2022-09-30 Fri 12:32] =>  0:27
arreglando emacs intentando infructuosamente de nuevo con eglot
CLOCK: [2022-09-30 Fri 10:27]--[2022-09-30 Fri 12:04] =>  1:37
procedo a probar los triggers de los campos nuevos de clientes
terminado de probar los triggers y adecuarlos en el server
CLOCK: [2022-09-30 Fri 08:35]--[2022-09-30 Fri 10:17] =>  1:42
terminado mostrar pagados maximo 5 y varias limpiezas mas.
CLOCK: [2022-09-30 Fri 08:21]--[2022-09-30 Fri 08:35] =>  0:14
:END:
*** [2022-09-29 Thu]
:LOGBOOK:
CLOCK: [2022-09-29 Thu 21:30]--[2022-09-29 Thu 22:29] =>  0:59
free hour arreglando emacs se rompio por littering
CLOCK: [2022-09-29 Thu 21:05]--[2022-09-29 Thu 21:13] =>  0:08
free minutes
CLOCK: [2022-09-29 Thu 19:45]--[2022-09-29 Thu 21:00] =>  1:15
nueva presentacion de tablas en el buscador
CLOCK: [2022-09-29 Thu 18:50]--[2022-09-29 Thu 19:05] =>  0:15
CLOCK: [2022-09-29 Thu 18:00]--[2022-09-29 Thu 18:50] =>  0:50
cambio de nombre a base_template
CLOCK: [2022-09-29 Thu 17:24]--[2022-09-29 Thu 17:59] =>  0:35
CLOCK: [2022-09-29 Thu 15:15]--[2022-09-29 Thu 15:35] =>  0:20
mucha optimizacion de emacs
CLOCK: [2022-09-29 Thu 14:46]--[2022-09-29 Thu 15:13] =>  0:27
CLOCK: [2022-09-29 Thu 13:12]--[2022-09-29 Thu 14:20] =>  1:08
CLOCK: [2022-09-29 Thu 12:30]--[2022-09-29 Thu 12:52] =>  0:22
terminado la refactorizacion de script.js
CLOCK: [2022-09-29 Thu 10:45]--[2022-09-29 Thu 12:29] =>  1:44
CLOCK: [2022-09-29 Thu 10:43]--[2022-09-29 Thu 10:45] =>  0:02
CLOCK: [2022-09-29 Thu 08:30]--[2022-09-29 Thu 10:42] =>  2:12
sacar de todos los archivos de static y linkear a cdn
:END:
*** [2022-09-28 Wed]
:LOGBOOK:
CLOCK: [2022-09-28 Wed 19:20]--[2022-09-28 Wed 20:32] =>  1:12
analice avy-> desechado. Reemplaze ido por ivy hay que acostumbrarse a
la forma de abrir los archivos.
CLOCK: [2022-09-28 Wed 19:09]--[2022-09-28 Wed 19:19] =>  0:10
free hour
CLOCK: [2022-09-28 Wed 15:33]--[2022-09-28 Wed 16:59] =>  1:26
hice los triggers y los campos en el servidor
falta ver de cargar el campo condonados por valor minimo de montocondonado
ya saque la condonacion de menor cuantia por redondeo <5%
CLOCK: [2022-09-28 Wed 14:21]--[2022-09-28 Wed 15:16] =>  0:55
reclasificamos el tag condonado para condonados por redondeo.
proceso campos nuevo en la base de datos: tarea delicada.
CLOCK: [2022-09-28 Wed 13:23]--[2022-09-28 Wed 14:20] =>  0:57
CLOCK: [2022-09-28 Wed 11:06]--[2022-09-28 Wed 12:54] =>  1:48
me hizo renegar un monton el alineamiento de los tags. Hasta que pude
resolverlo gracias a la instalacion del browser epiphany que es muy
bueno.
CLOCK: [2022-09-28 Wed 10:00]--[2022-09-28 Wed 10:50] =>  0:50
vista para los que estan pagando
correccion del bug Cornejo Alejandra: cancelo en 2021 y tiene alli su
ultpago pero compro ahora y su pmovto es 2022
CLOCK: [2022-09-28 Wed 08:39]--[2022-09-28 Wed 09:42] =>  1:03
saque irritante msg cuando no hay deuda y puse grande sin deuda
saque irritante pmovto viejo cuando esta cancelado
hice que sin comentarios sea un link que lleve abajo
CLOCK: [2022-09-28 Wed 07:31]--[2022-09-28 Wed 08:32] =>  1:01
necesito enfocar: trabajar sobre un solo tema: buscador para optimizar
la busqueda y la presentacion de los datos.
primero condonacion.
descubri antiguo bug de pq no se actualizaban los saldos
inmediatamente y es que usaba buscaCuentaporDni que toma los datos del
cliente de la lista leida antes de los cambios, se debe usar buscarCliente
:END:
*** [2022-09-27 Tue]
:LOGBOOK:
CLOCK: [2022-09-27 Tue 20:33]--[2022-09-27 Tue 21:33] =>  1:00
CLOCK: [2022-09-27 Tue 19:49]--[2022-09-27 Tue 20:29] =>  0:40
free hour
CLOCK: [2022-09-27 Tue 17:20]--[2022-09-27 Tue 17:46] =>  0:26
corrigiendo bugs
CLOCK: [2022-09-27 Tue 15:52]--[2022-09-27 Tue 17:18] =>  1:26
termino de afinar la busqueda en especial el uso de tags.
CLOCK: [2022-09-27 Tue 14:54]--[2022-09-27 Tue 15:24] =>  0:30
CLOCK: [2022-09-27 Tue 11:40]--[2022-09-27 Tue 14:27] =>  2:47
refinando los metodos de busqueda y cambie el cuadro de vista
agregando un table
CLOCK: [2022-09-27 Tue 11:25]--[2022-09-27 Tue 11:40] =>  0:15
bug en el sitio mobile- arreglado
CLOCK: [2022-09-27 Tue 10:23]--[2022-09-27 Tue 11:19] =>  0:56
busqueda mejorada-> agregue busquedas por id por wapp por acla y
respuestas personalizadas. Visualizo en desktop solo una barra de
busqueda. pq las otras dos son para trabajo en la calle.
CLOCK: [2022-09-27 Tue 08:58]--[2022-09-27 Tue 10:10] =>  1:12
termino de probar asientos e instalar en la web
CLOCK: [2022-09-27 Tue 08:30]--[2022-09-27 Tue 08:57] =>  0:27
agregue ido vertical mode a emacs y rg
:END:
*** [2022-09-26 Mon]
   :LOGBOOK:
   CLOCK: [2022-09-26 Mon 19:22]--[2022-09-26 Mon 20:14] =>  0:52
   cambiar los botones feos por awesome y otros retoques incluso
   cambie los themes por defecto.
   CLOCK: [2022-09-26 Mon 18:45]--[2022-09-26 Mon 19:01] =>  0:16
   CLOCK: [2022-09-26 Mon 18:30]--[2022-09-26 Mon 18:45] =>  0:15
   CLOCK: [2022-09-26 Mon 17:30]--[2022-09-26 Mon 18:24] =>  0:54
   me dispongo a tunear emacs que le voy a hacer
   lo aliviane lo maximo que pude y veremos que pasa.
   CLOCK: [2022-09-26 Mon 16:30]--[2022-09-26 Mon 16:59] =>  0:29
   CLOCK: [2022-09-26 Mon 15:43]--[2022-09-26 Mon 16:01] =>  0:18
   encaro la instalacion de la impresora
   CLOCK: [2022-09-26 Mon 14:31]--[2022-09-26 Mon 15:43] =>  1:12
   terminado asientos
   CLOCK: [2022-09-26 Mon 13:17]--[2022-09-26 Mon 14:30] => 1:13
   CLOCK: [2022-09-26 Mon 11:11]--[2022-09-26 Mon 13:01] => 1:50
   arreglo la vista asientos
   CLOCK: [2022-09-26 Mon 09:40]--[2022-09-26 Mon 11:10] => 1:30
   comienzo proyecto reforma contable
   terminado el crud cuentas
   CLOCK: [2022-09-26 Mon 08:57]--[2022-09-26 Mon 09:39] => 0:42
   termino de poner a punto vim con folder y Files global y Rg
   :END:
*** [2022-09-25 Sun]
   :LOGBOOK:
   CLOCK: [2022-09-25 Sun 18:30]--[2022-09-25 Sun 21:15] => 2:45
   optimizacion de vim - instalacion de kitty - conf.
   arreglo de bug de org-return
   CLOCK: [2022-09-25 Sun 09:56]--[2022-09-25 Sun 10:48] => 0:52
   :END:
*** [2022-09-24 Sat]
:LOGBOOK:
CLOCK: [2022-09-24 Sat 21:46]--[2022-09-24 Sat 22:35] => 0:49
   lamentablemente descubro que el enfoque de queue con clase
   no sirve pq aunque anda bien en un solo browser no anda en un ambiente de
   mas de un browser. Manana soluciono los branchs y vuelvo al whatalt2.
CLOCK: [2022-09-24 Sat 20:14]--[2022-09-24 Sat 21:00] => 0:46
   sigo tuneando vim. es una locura el hell que me agarro.
CLOCK: [2022-09-24 Sat 19:07]--[2022-09-24 Sat 20:04] => 0:57
   me hizo renegar el mapping de orgmode y telescope
CLOCK: [2022-09-24 Sat 16:14]--[2022-09-24 Sat 19:06] => 2:52
   vim hell al mango con org incluido!!!
CLOCK: [2022-09-24 Sat 14:40]--[2022-09-24 Sat 16:14] => 1:34
CLOCK: [2022-09-24 Sat 13:08]--[2022-09-24 Sat 13:59] =>  0:51
volviendo a nvim
CLOCK: [2022-09-24 Sat 12:25]--[2022-09-24 Sat 13:08] =>  0:43
CLOCK: [2022-09-24 Sat 10:10]--[2022-09-24 Sat 11:43] =>  1:33
terminado queue con class
CLOCK: [2022-09-24 Sat 10:01]--[2022-09-24 Sat 10:06] =>  0:05
probando otro sistema queue basado en clases
CLOCK: [2022-09-24 Sat 08:24]--[2022-09-24 Sat 09:41] =>  1:17
termine listado con dos formatos- hice el merge -
:END:
*** [2022-09-23 Fri]
:LOGBOOK:
CLOCK: [2022-09-23 Fri 17:44]--[2022-09-23 Fri 18:20] =>  0:36
terminado el queue - trabaje un poco en el orden de columnas de wapplog
CLOCK: [2022-09-23 Fri 15:48]--[2022-09-23 Fri 17:20] =>  1:32
probando el nuevo queue problemas con el libredeuda
CLOCK: [2022-09-23 Fri 14:00]--[2022-09-23 Fri 15:17] =>  1:17
haciendo listado nuevo
CLOCK: [2022-09-23 Fri 13:12]--[2022-09-23 Fri 13:43] =>  0:31
CLOCK: [2022-09-23 Fri 11:10]--[2022-09-23 Fri 12:35] =>  1:25
CLOCK: [2022-09-23 Fri 09:20]--[2022-09-23 Fri 10:45] =>  1:25
exitoso por el momento
CLOCK: [2022-09-23 Fri 09:16]--[2022-09-23 Fri 09:19] =>  0:03
voy a encarar un nuevo enfoque con la queue de whatsapp
CLOCK: [2022-09-23 Fri 08:50]--[2022-09-23 Fri 09:12] =>  0:22
solucione el problema de los archivos undo-tree
:END:
*** [2022-09-22 Thu]
:LOGBOOK:
CLOCK: [2022-09-22 Thu 17:07]--[2022-09-22 Thu 18:07] =>  1:00
subida la rama whatalt1 y prueba y correccion
CLOCK: [2022-09-22 Thu 15:35]--[2022-09-22 Thu 16:58] =>  1:23
refactorizacion de lib.py para flake y buscar.html
CLOCK: [2022-09-22 Thu 15:28]--[2022-09-22 Thu 15:34] =>  0:06
CLOCK: [2022-09-22 Thu 14:25]--[2022-09-22 Thu 14:53] =>  0:28
trasteo de nuevo con emacs.d/init.el
CLOCK: [2022-09-22 Thu 13:31]--[2022-09-22 Thu 14:17] =>  0:46
tedioso trabajo de arreglar refactorizar buscar.html
CLOCK: [2022-09-22 Thu 13:02]--[2022-09-22 Thu 13:31] =>  0:29
CLOCK: [2022-09-22 Thu 10:49]--[2022-09-22 Thu 12:18] =>  1:29
trabaje sobre intimarpdf para que sea nominada
CLOCK: [2022-09-22 Thu 08:53]--[2022-09-22 Thu 09:53] =>  1:00
otra version de la cola de wapps
CLOCK: [2022-09-22 Thu 08:21]--[2022-09-22 Thu 08:50] =>  0:29
trasteando el init.el
:END:
*** [2022-09-21 Wed]
:LOGBOOK:
CLOCK: [2022-09-21 Wed 19:57]--[2022-09-21 Wed 21:18] =>  1:21
nuevo enfoque en el delay de los wapps
CLOCK: [2022-09-21 Wed 19:47]--[2022-09-21 Wed 19:55] =>  0:08
CLOCK: [2022-09-21 Wed 18:33]--[2022-09-21 Wed 19:27] =>  0:54
CLOCK: [2022-09-21 Wed 15:00]--[2022-09-21 Wed 16:59] =>  1:59
termine rbotransferencia; hice utilidades/pdfsistema
CLOCK: [2022-09-21 Wed 13:35]--[2022-09-21 Wed 14:52] =>  1:17
continuo con la limpieza de buscar.html; inicio la refactorizacion de
rboportransferencia
CLOCK: [2022-09-21 Wed 12:00]--[2022-09-21 Wed 13:32] =>  1:32
terminado el envio de bajas a whatsapp
CLOCK: [2022-09-21 Wed 10:24]--[2022-09-21 Wed 11:41] =>  1:17
trabajo en el tema mensaje de invalid whatsapp
CLOCK: [2022-09-21 Wed 10:02]--[2022-09-21 Wed 10:13] =>  0:11
CLOCK: [2022-09-21 Wed 09:54]--[2022-09-21 Wed 09:56] =>  0:02
CLOCK: [2022-09-21 Wed 09:49]--[2022-09-21 Wed 09:53] =>  0:04
CLOCK: [2022-09-21 Wed 09:35]--[2022-09-21 Wed 09:48] =>  0:13
obtengo error en evil-mode en insert-mode con la tecla braceright.
CLOCK: [2022-09-21 Wed 08:28]--[2022-09-21 Wed 09:28] =>  1:00
optimizacion de teclado gringo para trabajar minimamente ya que no
pude hacerlo con el latam. Resigne la - en el menique.
:END:
*** [2022-09-20 Tue]
:LOGBOOK:
CLOCK: [2022-09-20 Tue 20:45]--[2022-09-20 Tue 22:00] =>  1:15
busqueda de otro reemplazo que sea mas seguro
CLOCK: [2022-09-20 Tue 20:25]--[2022-09-20 Tue 20:45] =>  0:20
CLOCK: [2022-09-20 Tue 18:30]--[2022-09-20 Tue 20:24] =>  1:54
busqueda de reemplazo de xmodmap: encontrado!!!!
es input-remapper y trabaja hasta ahora bastante bien, veremos
demore pero es una cuestion ergonomica fundamental que me ha hecho
sufrir mucho en estos ultimos dias el teclado gringo.
CLOCK: [2022-09-20 Tue 18:21]--[2022-09-20 Tue 18:30] =>  0:09
busqueda de funcionalidades de evil-mode
CLOCK: [2022-09-20 Tue 12:14]--[2022-09-20 Tue 12:43] =>  0:29
capturar como res el response.text y ver si el wapp es invalid
y dar msg acorde en js
CLOCK: [2022-09-20 Tue 11:05]--[2022-09-20 Tue 12:14] =>  1:09
perdida de tiempo para encontrar la vuelta a evil-mode
CLOCK: [2022-09-20 Tue 10:47]--[2022-09-20 Tue 11:04] =>  0:17
CLOCK: [2022-09-20 Tue 09:25]--[2022-09-20 Tue 10:24] =>  0:59
CLOCK: [2022-09-20 Tue 09:13]--[2022-09-20 Tue 09:22] =>  0:09
excurso emacs para probar otro modal
CLOCK: [2022-09-20 Tue 08:34]--[2022-09-20 Tue 08:49] =>  0:15
arreglar urgente bug de impresion fichas
:END:
*** [2022-09-19 Mon]
:LOGBOOK:
CLOCK: [2022-09-19 Mon 21:20]--[2022-09-19 Mon 23:49] =>  2:29
CLOCK: [2022-09-19 Mon 17:32]--[2022-09-19 Mon 20:50] =>  3:18
CLOCK: [2022-09-19 Mon 17:10]--[2022-09-19 Mon 17:31] =>  0:21
resuelto el bug pasarplanillas resulto ser una multiplicacion de int
con str en la preparacion de un insert en python. Se destaca el
descubrimiento del log1 que te muestra la salida de gunicorn sino no
hubiera podido hacer nada.
CLOCK: [2022-09-19 Mon 15:11]--[2022-09-19 Mon 16:40] =>  1:29
gran problema rastreando el bug pasarplanillas
CLOCK: [2022-09-19 Mon 15:24]--[2022-09-19 Mon 16:41] =>  1:17
CLOCK: [2022-09-19 Mon 14:17]--[2022-09-19 Mon 15:10] =>  0:53
se intenta solucionar el bug de nginx con los whatsapp
se intenta tomar el rastro de los numeros inactivos
se intenta hacer una cola general para los requests
CLOCK: [2022-09-19 Mon 12:13]--[2022-09-19 Mon 13:50] =>  1:37
analizar bug a pedido de ndryon
CLOCK: [2022-09-19 Mon 11:12]--[2022-09-19 Mon 12:13] =>  1:01
CLOCK: [2022-09-19 Mon 10:53]--[2022-09-19 Mon 11:12] =>  0:19
agregar mas mensajes programables y poner un dropdown
:END:
*** [2022-09-17 sb]
   :LOGBOOK:
   CLOCK: [2022-09-17 sb 18:47]--[2022-09-17 Sat 19:52] =>  1:05
   de emergencia un chequeo al envio de libre deuda si la cuenta esta cancelada
   CLOCK: [2022-09-17 sb 15:05]--[2022-09-17 sb 15:41] =>  0:36
   busqueda de optimizacion de emacs (fallida)
   CLOCK: [2022-09-17 sb 14:30]--[2022-09-17 sb 15:01] =>  0:31
   CLOCK: [2022-09-17 sb 12:45]--[2022-09-17 sb 13:09] =>  0:24
   arreglos en emacs
   CLOCK: [2022-09-17 sb 11:48]--[2022-09-17 sb 12:44] =>  0:56
   arregle el acceso de adminer a la base de datos. Me hizo renegar un
   monton.
   CLOCK: [2022-09-17 sb 11:05]--[2022-09-17 sb 11:33] =>  0:28
   carge todos los codigos y grupos a la tabla articulos
   CLOCK: [2022-09-17 sb 10:43]--[2022-09-17 sb 11:01] =>  0:18
   pasado a hoverable y arreglado las importaciones .lib
   CLOCK: [2022-09-17 sb 09:59]--[2022-09-17 sb 10:14] =>  0:15
   pasar a is-hoverable -- urgente arreglar los .lib
   CLOCK: [2022-09-17 sb 09:00]--[2022-09-17 sb 09:30] =>  0:30
   resolviendo un bug. Los whatsapp se entregan pero dan codigo 500 y
   por lo tanto dan notificacion erronea
   Bug resuelto: era que no habia creado el directorio ~/log para el
   log de wapps. Por el momento se encuentra el log de debug en
   systemctl status app.
   CLOCK: [2022-09-17 sb 07:39]--[2022-09-17 sb 09:00] =>  1:21
   inicio el cambio de servidor a nginx.
   se hizo un servidor espejo en pachito.xyz.
   se reinicio el servidor fedesal.lol
   se instalo de nuevo debian 10
   se instalo todo con nginx
   :END:
*** [2022-09-16 vie]
   :LOGBOOK:
   CLOCK: [2022-09-16 vie 17:54]--[2022-09-16 vie 18:08] =>  0:14
   CLOCK: [2022-09-16 vie 16:51]--[2022-09-16 vie 17:38] =>  0:47
   CLOCK: [2022-09-16 vie 16:10]--[2022-09-16 vie 16:44] =>  0:34
   implementacion de bulma-dropdowns en buscar.html
   CLOCK: [2022-09-16 vie 14:10]--[2022-09-16 vie 15:59] =>  1:49
   optimizacion de emacs
   CLOCK: [2022-09-16 vie 12:29]--[2022-09-16 vie 13:33] =>  1:04
   agregado funcionalidad de codigo de articulos en ventas y salida de
   mercaderia y en lista de precios
   CLOCK: [2022-09-16 vie 09:57]--[2022-09-16 vie 11:23] =>  1:26
   hice fk en tablas artcomprado/detvta/detallesalida para que los art
   se actualicen en cascada y para que la tabla articulo sea realmente
   la mandatory respecto a los articulos.
   CLOCK: [2022-09-16 vie 08:12]--[2022-09-16 vie 09:02] =>  0:50
   terminado el cobrado/estimado en planilla recibo
   :END:
*** [2022-09-15 jue]
   :LOGBOOK:
   CLOCK: [2022-09-15 jue 20:10]--[2022-09-15 jue 20:31] =>  0:21
   CLOCK: [2022-09-15 jue 17:05]--[2022-09-15 jue 17:37] =>  0:32
   bug irresuelto: no funciona en server pero si en local: imprimir
   listagenerada. Termino siendo problema de cache. Al tener el mismo
   nombre el browser usa el cache. tuve que agregarle una terminacion
   aleatoria con time.
   CLOCK: [2022-09-15 jue 14:45]--[2022-09-15 jue 16:11] =>  1:26
   hice manejo de error para los whatsapp en caso de no tener whatsapp
   y no tener repuesta 200, tambien hice un log.
   CLOCK: [2022-09-15 jue 12:34]--[2022-09-15 jue 13:18] =>  0:44
   CLOCK: [2022-09-15 jue 11:05]--[2022-09-15 jue 12:21] =>  1:16
   lista de precios automatica
   CLOCK: [2022-09-15 jue 10:04]--[2022-09-15 jue 10:50] =>  0:46
   CLOCK: [2022-09-15 jue 08:16]--[2022-09-15 jue 09:30] =>  1:14
   termine de revisar todo el codigo de articulos.html cambiando todo
   a alpine-js y a Swall, simplificando las funciones lo mas posible.
   CLOCK: [2022-09-15 jue 08:04]--[2022-09-15 jue 08:16] =>  0:12
   corregi problema de pachito agregando crontab para el restart del
   servicio como esta hecho en apache, e hice que el backup se haga
   por hora.
   :END:
